{
    "profile":{
        "rol": "Desarrollado Front-End",
        "description":"Llevo 2 años y medio incursionando en el apasionante mundo de la programacion web. Apasionado de las nuevas tecnologias, en especial el ecosistema CSS, JS y ReactJS. <br /> Mi objetivo es poder encontrar mi primer trabajo donde me pueda desempeñar profesionalmente, demostrar mis habilidades y continuar aprendiendo."
    },
    "experience":{
        "general-title": "Experiencia",
        "first-job-title": "Freelance Front-End",
        "first-job-dates":"Abr 2020 - Actualidad",
        "first-job-description":"Desde hace 2 años comence con pequeños proyectos en HTML y CSS en el armado de paginas comerciales basicas donde el contenido era estatico. Luego tome proyectos donde se deben realizar interacciones entre la web y el usuario, aqui comence a introducir lenguaje de Javascript para realizar estas operaciones. Gracias a esto fui adquiriendo nuevos conocimientos y explorando distintos frameworks que facilitan el armado de una web con una calidad profesional extra, como los son Bootstrap o Material UI. En resumen, en estos dos años implemente conocimientos en HTML5, CCS3, Javascript ES6, React, JQuery, Git y JIRA/ClickUp",
        "second-job-title": "Shitsuke S.R.L.",
        "second-job-dates":"Sep 2005 - Actualidad",
        "second-job-description":"Funciones<br/><br/>        • Planificación y gestión de las actividades en el campo de la electrotecnología y eficiencia energética<br/>        • Normalización y aplicación de normas técnicas para el comité de normas IRAM<br/>        • Gestión, planificación, asistencia y evaluación sobre 12 colaboradores<br/>        • Soporte y asistencia técnica a clientes ante los requisitos establecidos por normas IRAM e IEC"
    },
    "hobbies":{
        "first-hobbie-title":"Gamming",
        "first-hobbie-description":"Nunca se deja de ser chico! O al menos eso me gustaria creer ja. Uno de mis pasatiempos preferidos son los juegos en PC, en especial los competitivos como CS Go o Dota2.",
        "second-hobbie-title":"Football",
        "second-hobbie-description":"Otro hobbie que me apasiona es jugar al football, siempre es bueno juntarse con amigos pero mejor aun se hay una pelota de por medio.",
        "last-hobbie-title":"Familia y Amigos",
        "last-hobbie-description":"Por ultimo pero no menos importante, me encanta disfrutar de salir con amigos, ver series y peliculas y pasar momentos hermosos en familia."
    },

    "proyect":{
        "proyect-one-title": "Peliculas",
        "proyect-one-description-1":"Primer proyecto utilizando ReactJS",
        "proyect-one-description-2":"En este proyecto utilizo React JS puro con algunas dependencias dentro del ecosistema de React como lo es React Router V6 para el enlazado de las distintas páginas. Además, implemento el uso de hooks predeterminados como el useState y useEffect como también algunos hooks personalizados, los cuales utilice para el buscador. <br/>Por otro lado realizo el consumo de la api https://www.themoviedb.org, api gratuita para este tipo de proyectos.",
        "proyect-two-title": "Test Challenge Spot2",
        "proyect-two-description-1":"Desafio tecnico",
        "proyect-two-description-2":"En este desafio debia utilizar un filtrado para mostrar distintos spots dependiendo de parametros como el tamaño y ubicacion. Ademas utilizar un mapa donde se visualizaran los markets, para ello utilice Context. Ademas hice uso de PropTypes, ReactRouter, styled Component y axios para realizar la request al endpoint.",
        "proyect-three-title": "Sitio web GAC SRL",
        "proyect-three-description-1":"Pagina web de empresa de limpieza",
        "proyect-three-description-2":"Pagina web de 5 secciones con formulario para solicitud de presupuesto y envio de CV. Para el diseño utilice Figma para presentar al cliente la visual y para programar Boostrap junto con SASS.",
        "proyect-four-title": "Weather App",
        "proyect-four-description-1":"Proyecto realizado para el curso de Javascript en Coderhouse",
        "proyect-four-description-2":"En esta APP utilizo vainilla JS para el desarrollo de toda la apliacion. En la cual mediante fetch asincrono llamo a la API 'Open Weather API' la cual me devuelve el pronostico de los proximos 5 dias. Genero una pequeña interaccion con el usuario el cual permite guardase las ciudades favoritas. Esta data se almacena en el localStorage.",
        "proyect-five-title": "Bateria",
        "proyect-five-description-1":"Pagina que realice de practica para eventos de teclado",
        "proyect-five-description-2":"En esta pequeña aplicacion utilizo la escucha de eventos del teclado y una pequeña animacion para generar el efecto de accion sobre cada 'caja'.",
        "proyect-six-title": "JavaScrip & DOM",
        "proyect-six-description-1":"Pagina donde muestro varios usos del DOM y sus herramientas (EN CONSTRUCCION!)",
        "proyect-six-description-2":"El proyecto anterior de la bateria me motivo a desarrollar una pagina en donde se muestren los usos del DOM y las herramientas o APIs nativas que trae el navegador, como el uso de deteccion de una camara web, geolocalizacion, eventos y escuchas, entre otras cosas. En cuanto a CSS no hay mucho desarrollo ya que la idea principal es la ejecucion de Javascript.",
        "proyect-seven-description-1":"Practica de conceptos básicos",
        "proyect-seven-description-2":"Para poner en practica lo visto en mis primeros pasos en React realice algunas cards para practicar el concepto de componente y props de los mismos, ademas un contador para practicar el uso de estados y sus cambios, también una calculadora y por ultimo una lista de tareas donde por medio de props, estado y funciones, agrego, quito o tacho tareas a realizar.",
        "proyect-eight-title": "Proyecto Ecommerce con React & Firebase",
        "proyect-eight-description-1":"Desarrollo Ecommerce",
        "proyect-eight-description-2":"Proyecto React de un Ecommerce donde utilizo distintos tipos de vista como modales o ruteo con React Router, distintos tipos de filtrados, context para el manejo de carrito, Firebase para el manejo de base de datos, entre otras cosas."


    },
    "study":{
        "study-one-description":"Gracias a Jon Mircha pude aprender muchísimos conceptos de Javascript. Te enseña todo el lenguaje desde cero, arrancando por tipo de datos, variables, alcances, funciones etc hasta lo último y más avanzado. Al día de hoy tiene más de 100 videos continúa subiendo con las ultimas actualizaciones que salen de Javascipt. ¡Lo recomiendo mucho!",
        "study-two-description":"Además de enseñar de manera minuciosa Javascript, también lo hace con React. Al igual que JS arranca desde el nivel 0 para las personas que no tienen absolutamente nada de conocimiento, arrancando desde la instalación de React hasta el uso de hooks, uso de apis, ajax, fetch, entre otras cosas. Gracias a estos videos de Jon Mircha continúo aprendiendo React.",
        "study-three-description":"Dalto es un programador muy conocido hoy en redes entre los jóvenes. Con el empezó todo, escribí mi primer 'Hola mundo' en el navegador. Tiene una manera divertida de hacer que aprendas desde lo más básico en HTML, CSS y Javascript. Recomiendo mucho a Dalto para dar los primeros pasos en el desarrollo web.",
        "study-four-description":"Al igual que con el curso de HTML, Dalto explica de forma divertida y amena muchísimos conceptos de CSS en un video que dura casi unas 10hs (editado!) lo cual no hay más que agradecimiento desde las personas que queremos aprender y adentrarnos en este mundo tan inmenso."
    }
}