{
    "profile":{
        "rol": "Front-End Developer",
        "description":"I've been 2 and a half years venturing into the exciting world of web programming. Passionate about new technologies, especially the CSS, JS and ReactJS ecosystem. My goal is to be able to find my first job where I can perform professionally, demonstrate my skills and continue learning."
    },
    "experience":{
        "general-title": "Experience",
        "first-job-title": "Freelance Front-End",
        "first-job-dates":"Abr 2020 - Current",
        "first-job-description":"For 2 years I started with small projects in HTML and CSS in the assembly of basic commercial pages where the content was static. Then take projects where interactions between the web and the user must be carried out, here I began to introduce the Javascript language to carry out these operations. Thanks to this I was acquiring new knowledge and exploring different frameworks that facilitate the creation of a website with an extra professional quality, such as Bootstrap or Material UI. In summary, in these two years I implemented knowledge in HTML5, CCS3, Javascript ES6, React, JQuery, Git and JIRA/ClickUp",
        "second-job-title": "Shitsuke S.R.L.",
        "second-job-dates":"Sep 2005 - Current",
        "second-job-description":"Functions<br/><br/>        • Planning and management of activities in the field of electrotechnology and energy efficiency<br/>        • Standardization and application of technical standards for the IRAM standards committee <br/>       • Management, planning, assistance and evaluation of 12 collaborators<br/>        • Support and technical assistance to clients in response to the requirements established by IRAM and IEC standards."
    },
    "hobbies":{
        "first-hobbie-title":"Gamming",
        "first-hobbie-description":"You never stop being a child! Or at least that's what I'd like to believe. One of my favorite hobbies is gaming on PC, especially competitive ones like CS Go or Dota2.",
        "second-hobbie-title":"Football",
        "second-hobbie-description":"Another hobby that I am passionate about is playing football, it is always good to get together with friends but it is even better when there is a ball involved.",
        "last-hobbie-title":"Family and Friends",
        "last-hobbie-description":"Last but not least, I love to enjoy going out with friends, watching series and movies and spending beautiful moments with my family."
    },
    "project":{
        "project-one-title": "Movies",
        "project-one-description-1":"First project using ReactJS",
        "project-one-description-2":"In this project I use pure React JS with some dependencies within the React ecosystem such as React Router V6 for the linking of the different pages. In addition, I implement the use of default hooks like useState and useEffect as well as some custom hooks, which I use for the browser. <br/>On the other hand, I use the https://www.themoviedb.org api, a free api for this type of project.",
        "project-two-title": "Test Challenge Spot2",
        "project-two-description-1":"Test Challenge",
        "project-two-description-2":"In this challenge, I had to use a filter to show different spots depending on parameters such as size and location. Also use a map where the markets will be displayed, for this use Context. I also used PropTypes, ReactRouter, styled Component and axios to make the request to the endpoint.",
        "project-three-title": "GAC SRL Website",
        "project-three-description-1":"Cleaning company website",
        "project-three-description-2":"Web page with 5 sections with a form to request a quote and send a CV. For the design use Figma to present the visual to the client and to program Bootstrap together with SASS.",
        "project-four-title": "Weather App",
        "project-four-description-1":"Project made for the Javascript course in Coderhouse",
        "project-four-description-2":"In this APP I use vanilla JS for the development of the entire application. In which through asynchronous fetch I call the API 'Open Weather API' which returns the forecast for the next 5 days. I generate a small interaction with the user which allows the favorite cities to be saved. This data is stored in localStorage.",
        "project-five-title": "Batery",
        "project-five-description-1":"Page I did for practice for keyboard events",
        "project-five-description-2":"In this small application I use the keyboard event listener and a small animation to generate the action effect on each 'box'.",
        "project-six-title": "JavaScrip & DOM",
        "project-six-description-1":"Page where I show various uses of the DOM and its tools (UNDER CONSTRUCTION!)",
        "project-six-description-2":"The previous battery project motivated me to develop a page that shows the uses of the DOM and the native tools or APIs that the browser brings, such as the use of detection of a webcam, geolocation, events and listeners, among other things. . Regarding CSS there is not much development since the main idea is the execution of Javascript.",
        "project-seven-title": "Basics React",
        "project-seven-description-1":"Basics Practice",
        "project-seven-description-2":"To put into practice what I saw in my first steps in React, I made some cards to practice the concept of components and their props, as well as a counter to practice the use of states and their changes, also a calculator and finally a list of tasks where by means of props, state and functions, I add, remove or cross out tasks to perform.",
        "project-eight-title": "Project Ecommerce whit React & Firebase",
        "project-eight-description-1":"Project Ecommerce",
        "project-eight-description-2":"React project of an Ecommerce where I use different types of views such as modals or routing with React Router, different types of filtering, context for cart management, Firebase for database management, among other things."


 },
    "study":{
        "study-one-description":"Thanks to Jon Mircha I was able to learn a lot of Javascript concepts. It teaches you the entire language from scratch, starting with data types, variables, scopes, functions, etc. to the latest and most advanced. To date, it has more than 100 videos, it continues to upload with the latest updates coming out of Javascipt. I highly recommend it!",
        "study-two-description":"In addition to thoroughly teaching Javascript, he also teaches React. Just like JS, it starts from level 0 for people who have absolutely no knowledge, starting from the installation of React to the use of hooks, use of apis, ajax, fetch, among other things. Thanks to these videos by Jon Mircha I continue to learn React.",
        "study-three-description":"Dalto is a well-known programmer today in networks among young people. It all started with him, I wrote my first 'Hello world' in the browser. It has a fun way of making you learn from the very basics of HTML, CSS, and Javascript. I highly recommend Dalto to take the first steps in web development.",
        "study-four-description":"As with the HTML course, Dalto explains many CSS concepts in a fun and entertaining way in a video that lasts almost 10 hours (edited!) for which there is nothing but thanks from the people who want to learn and enter this world so huge"
}
}